БухЭксп/Documents/CW_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РеестрПлатежей</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПланированиеДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставРеестраПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставРеестраПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_РеестрПлатежей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//Процедуры обновления
Процедура ПеренетиДанныеВРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрПлатежейСписокПлатежныхПоручений.Ссылка КАК Ссылка,
	               |	CW_РеестрПлатежейСписокПлатежныхПоручений.ПлатежноеПоручение КАК ПлатежноеПоручение
	               |ИЗ
	               |	Документ.CW_РеестрПлатежей.УДАЛИТЬСписокПлатежныхПоручений КАК CW_РеестрПлатежейСписокПлатежныхПоручений
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПлатежноеПоручение)
	               |ПО
	               |	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		мСоставРеестра = Новый Массив;
		
		ВыборкаДетали = ВыборкаСсылка.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			мСоставРеестра.Добавить(ВыборкаДетали.ПлатежноеПоручение);
		КонецЦикла;
		
		Если мСоставРеестра.Количество() > 0 Тогда
			РегистрыСведений.CW_СоставРеестраПлатежей.ЗаписатьСоставРеестраПлатежей(ВыборкаСсылка.Ссылка,  мСоставРеестра);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедуры обновления

Процедура СформироватьПлатежныеПоручения(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	КПППлательщика = Справочники.Организации.КППНаДату(ПараметрыПроцедуры.Организация, ПараметрыПроцедуры.Дата); 
	ИННПлательщика = ПараметрыПроцедуры.Организация.ИНН;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка",  ПараметрыПроцедуры.Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья КАК Статья,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.Контрагент КАК Контрагент,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.Договор КАК Договор,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.ВидОперацииПлатежногоПоручения КАК ВидОперацииПлатежногоПоручения,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.ДокументОснование КАК ДокументОснование,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.ОснованиеОплаты КАК ОснованиеОплаты,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.СтатьяДДС КАК СтатьяДДС,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.СтатьяДДС.ОсновнаяСтатьяДДС КАК ОсновнаяСтатьяДДС,
	|	CW_РеестрПлатежейОбъектыПлатежа.Сумма КАК Сумма,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.СтавкаНДС КАК СтавкаНДС,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.СуммаНДС КАК СуммаНДС,
	|	CW_РеестрПлатежейОбъектыПлатежа.Статья.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.CW_РеестрПлатежей.ОбъектыПлатежа КАК CW_РеестрПлатежейОбъектыПлатежа
	|ГДЕ
	|	CW_РеестрПлатежейОбъектыПлатежа.Ссылка = &Ссылка";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
	|	ВТ_ДанныеДокумента.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
	|	ВТ_ДанныеДокумента.Договор КАК Договор,
	|	ВТ_ДанныеДокумента.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_ДанныеДокумента.ВидОперацииПлатежногоПоручения КАК ВидОперацииПлатежногоПоручения,
	|	ВТ_ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВТ_ДанныеДокумента.Сумма) КАК Сумма,
	|	ВТ_ДанныеДокумента.ОсновнаяСтатьяДДС КАК СтатьяДвиженияДенежныхСредств,
	|	ВТ_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
	|	ВТ_ДанныеДокумента.ОснованиеОплаты КАК ОснованиеОплаты
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.ВидОперацииПлатежногоПоручения,
	|	ВТ_ДанныеДокумента.Договор,
	|	ВТ_ДанныеДокумента.Контрагент,
	|	ВТ_ДанныеДокумента.РасчетныйСчетКонтрагента,
	|	ВТ_ДанныеДокумента.ОсновнаяСтатьяДДС,
	|	ВТ_ДанныеДокумента.ДокументОснование,
	|	ВТ_ДанныеДокумента.ОснованиеОплаты,
	|	ВТ_ДанныеДокумента.ПриложениеКДоговору,
	|	ВТ_ДанныеДокумента.СтавкаНДС
	|ИТОГИ
	|	СУММА(СуммаНДС),
	|	СУММА(Сумма)
	|ПО
	|	СтавкаНДС,
	|	ВидОперацииПлатежногоПоручения,
	|	СтатьяДвиженияДенежныхСредств,
	|	Контрагент,
	|	РасчетныйСчетКонтрагента,
	|	Договор,
	|	ПриложениеКДоговору,
	|	ДокументОснование,
	|	ОснованиеОплаты";
	
	РезультатЗапроса =	Запрос.Выполнить();
	
	мСозданныеДокументы = Новый Массив;
	
	ВыборкаСтавкаНДС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтавкаНДС.Следующий() Цикл
		
		ВыборкаВидОперации = ВыборкаСтавкаНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВидОперации.Следующий() Цикл
			
			ВыборкаСтатьяДвиженияДенежныхСредств = ВыборкаВидОперации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСтатьяДвиженияДенежныхСредств.Следующий() Цикл
				
				ВыборкаКонтрагент = ВыборкаСтатьяДвиженияДенежныхСредств.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					ВыборкаРасчетныйСчет = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаРасчетныйСчет.Следующий() Цикл
						
						КПППолучателя = Справочники.Контрагенты.КППНаДату(ВыборкаКонтрагент.Контрагент, ПараметрыПроцедуры.Дата); 
						ИННПолучателя = ВыборкаКонтрагент.Контрагент.ИНН;
						
						БанковскийСчетКонтрагента = ВыборкаРасчетныйСчет.РасчетныйСчетКонтрагента;
						Если Не ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
							БанковскийСчетКонтрагента = БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ВыборкаКонтрагент.Контрагент);
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
							БанковскийСчетКонтрагента = ПолучитьЕдинственныйСчетКонтрагента(ВыборкаКонтрагент.Контрагент);
						КонецЕсли;
						
						ТекстПолучателя = УчетДенежныхСредствБП.СформироватьТекстНаименованияПлательщикаПолучателя(
						"",
						ВыборкаКонтрагент.Контрагент,
						БанковскийСчетКонтрагента,
						Ложь,
						ПараметрыПроцедуры.Дата);
						
						ТекстПлательщика = УчетДенежныхСредствБП.СформироватьТекстНаименованияПлательщикаПолучателя(
						"",
						ПараметрыПроцедуры.Организация,
						ПараметрыПроцедуры.СчетОрганизации,
						Ложь,
						ПараметрыПроцедуры.Дата);
						
						
						ВыборкаДоговор = ВыборкаРасчетныйСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговор.Следующий() Цикл
							
							ВыборкаПриложение = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаПриложение.Следующий() Цикл
								
								НовыйДокумент = Документы.ПлатежноеПоручение.СоздатьДокумент();
								НовыйДокумент.Дата 				 = ПараметрыПроцедуры.Дата;
								НовыйДокумент.ВалютаДокумента 	 = ПараметрыПроцедуры.Валюта;
								НовыйДокумент.ОчередностьПлатежа = УчетДенежныхСредствКлиентСервер.ОчередностьПлатежаПоУмолчанию();
								
								НовыйДокумент.Организация 		= ПараметрыПроцедуры.Организация;  
								
								//Для версии КОРП
								НовыйДокумент.ПодразделениеОрганизации = ПараметрыПроцедуры.ПодразделениеОрганизации;  
								//Для версии КОРП
								
								НовыйДокумент.СчетОрганизации 	= ПараметрыПроцедуры.СчетОрганизации;
								
								НовыйДокумент.ИННПлательщика 	= ИННПлательщика;
								НовыйДокумент.КПППлательщика 	= КПППлательщика;
								НовыйДокумент.ТекстПлательщика 	= ТекстПлательщика;
								
								НовыйДокумент.Контрагент 		= ВыборкаПриложение.Контрагент;   
								НовыйДокумент.СчетКонтрагента 	= БанковскийСчетКонтрагента;
								
								НовыйДокумент.ИННПолучателя 	= ИННПолучателя;
								НовыйДокумент.КПППолучателя 	= КПППолучателя;
								НовыйДокумент.ТекстПолучателя 	= ТекстПолучателя;
								
								Если ТипЗнч(ВыборкаПриложение.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда 
									
									СтруктураПараметров = Новый Структура;
									СтруктураПараметров.Вставить("Договор", 			ВыборкаПриложение.Договор);
									СтруктураПараметров.Вставить("ПриложениеКДоговору",	ВыборкаПриложение.ПриложениеКДоговору);
									
									НовыйДокумент.ДоговорКонтрагента = CW_Финансы.ПолучитьУчетныйДоговор(СтруктураПараметров);
									
								Иначе
									НовыйДокумент.ДоговорКонтрагента = ВыборкаПриложение.Договор;
								КонецЕсли;
								
								НовыйДокумент.СтатьяДвиженияДенежныхСредств = ВыборкаПриложение.СтатьяДвиженияДенежныхСредств;
								
								НовыйДокумент.ВидОперации 			= ВыборкаПриложение.ВидОперацииПлатежногоПоручения;
								НовыйДокумент.СуммаДокумента 		= ВыборкаПриложение.Сумма;
								НовыйДокумент.СуммаНДС 				= ВыборкаПриложение.СуммаНДС;
								НовыйДокумент.СтавкаНДС 			= ВыборкаСтавкаНДС.СтавкаНДС;
								
								ВыборкаДокументОснование = ВыборкаПриложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								ДополнениеНазначенияПлатежа = ", ";
								Пока ВыборкаДокументОснование.Следующий() Цикл
									Если ЗначениеЗаполнено(ВыборкаДокументОснование.ДокументОснование) Тогда
										Если ТипЗнч(ВыборкаДокументОснование.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда 
											ДополнениеНазначенияПлатежа = ДополнениеНазначенияПлатежа + "Счет №"+ ВыборкаДокументОснование.ДокументОснование.НомерВходящегоДокумента + " от " + Формат(ВыборкаДокументОснование.ДокументОснование.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy") + ";";
										ИначеЕсли ТипЗнч(ВыборкаДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
											ДополнениеНазначенияПлатежа = ДополнениеНазначенияПлатежа + "Акт №"+ ВыборкаДокументОснование.ДокументОснование.НомерВходящегоДокумента + " от " + Формат(ВыборкаДокументОснование.ДокументОснование.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy") + ";";
										ИначеЕсли ТипЗнч(ВыборкаДокументОснование.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
											
											Если ВыборкаДокументОснование.ДокументОснование.ПредъявленСчет Тогда
												ДополнениеНазначенияПлатежа = ДополнениеНазначенияПлатежа + "Счет №"+ ВыборкаДокументОснование.ДокументОснование.НомерСчета + " от " + Формат(ВыборкаДокументОснование.ДокументОснование.ДатаСчета,"ДФ=dd.MM.yyyy") + ";";
											ИначеЕсли ВыборкаДокументОснование.ДокументОснование.ПредъявленАкт Тогда
												ДополнениеНазначенияПлатежа = ДополнениеНазначенияПлатежа + "Акт №"+ ВыборкаДокументОснование.ДокументОснование.НомерАкта + " от " +  Формат(ВыборкаДокументОснование.ДокументОснование.ДатаАкта,"ДФ=dd.MM.yyyy") + ";";
											КонецЕсли
											
										КонецЕсли;
									Иначе
										ВыборкаОснованияОпаты = ВыборкаДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										Пока ВыборкаОснованияОпаты.Следующий() Цикл
											ДополнениеНазначенияПлатежа = ДополнениеНазначенияПлатежа + ВыборкаОснованияОпаты.ОснованиеОплаты + ";";	
										КонецЦикла;
									Конецесли;
								КонецЦикла;
								
								Если Не ПустаяСтрока(ДополнениеНазначенияПлатежа) Тогда
									КоличествоСимволов = СтрДлина(СокрП(ДополнениеНазначенияПлатежа))-1;
									ДополнениеНазначенияПлатежа = Лев(СокрП(ДополнениеНазначенияПлатежа), КоличествоСимволов);
								КонецЕсли;
								
								ПараметрыНазначенияПлатежа = Документы.ПлатежноеПоручение.НовыеПараметрыНазначенияПлатежа();
								ЗаполнитьЗначенияСвойств(ПараметрыНазначенияПлатежа, НовыйДокумент);
								ТекстНазначенияАвто = Документы.ПлатежноеПоручение.ТекстНазначенияПлатежа(ПараметрыНазначенияПлатежа);
								ТекстНазначенияАвто = ТекстНазначенияАвто + ДополнениеНазначенияПлатежа;
								
								АвтоЗначенияРеквизитов = УчетДенежныхСредствБП.СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
								НовыйДокумент.Организация,
								НовыйДокумент.СчетОрганизации,
								НовыйДокумент.Контрагент,
								НовыйДокумент.СчетКонтрагента,
								Ложь,
								НовыйДокумент.Дата);
								
								АвтоЗначенияРеквизитов.Вставить("ТекстНазначенияПлатежа", ТекстНазначенияАвто);
								
								
								Документы.ПлатежноеПоручение.СформироватьНазначениеПлатежа(
								НовыйДокумент,
								АвтоЗначенияРеквизитов,
								Ложь,
								Ложь);
								
								НовыйДокумент.Записать();
								
								РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(НовыйДокумент.Ссылка, ПредопределенноеЗначение("Перечисление.СостоянияБанковскихДокументов.Подготовлено"));  
								
								мСозданныеДокументы.Добавить(НовыйДокумент.Ссылка);
								
							КонецЦикла;	 
						КонецЦикла;	 
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(мСозданныеДокументы, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьЕдинственныйСчетКонтрагента(Владелец)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоСчетов = Справочники.БанковскиеСчета.КоличествоБанковскихСчетовОрганизации(Владелец);
	
	Если КоличествоСчетов = 1 Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");

КонецФункции

#КонецЕсли
